{
  "basics": {
    "name": "TED Vortex",
    "label": "Fullstack Puppet/Node/React",
    "picture": "images/AAEAAQAAAAAAAAKiAAAAJDMyOTdmYThiLTIzMWUtNDc2NS05YjA2LWY5NDRkNzlmZDVhNQ.jpg",
    "phone": "+44 (7477) 132686",
    "website": "https://vortex.one",
    "summary": "I'm a self-taught technology enthusiast working mostly with ReactJS, Puppet and Docker nowadays. My main areas of focus are performance optimisation, security auditing and user experience. I'm currently following the RAIL model.\n\nI'd like to point out some of the philosophical concepts that fuel my perception as a programmer with a small summary of their practical usage:\n- DRY (Don't Repeat Yourself): Code duplication is rarely a problem nowadays even for junior developers, however with the increase of open source commercial software, package managers introduced the concept of deep tree dependency duplication. Wether it is NPM or Composer, I use DRY to keep my dependency graph as clean as possible.\n- KISS (Keep It Simple Stupid): I use KISS to keep my applications condensed into small re-usable components; I like to avoid monolithic apps because generally speaking they are not portable enough.\n- OCCAM'S RAZOR (Among competing hypotheses, the one with the fewest assumptions should be selected): This concept is most useful to me in deciding what software stack to use for a set of given requirements.\n- ZENO'S PARADOXES (Fletcher's paradox): This is not a direct translation of the paradox as I've been merely inspired by these paradoxes; this one in particular divides time into points, a concept I generally apply to assess scalability issues.\n- GODEL'S INCOMPLETENESS THEOREM: A very complex concept that I use to determine if application components are consistent or complete; A system that is complete will not be consistent is a problem I've faced many times with a very common example being excessive unit testing.\n- SCHRODINGER'S CAT (a cat imagined as being enclosed in a box with a radioactive source and a poison that will be released when the source (unpredictably) emits radiation, the cat being considered to be simultaneously both dead and alive until the box is opened and the cat observed): A simple concept that underlines the importance of debugging and performance analysis - to put it simply, a system that cannot be observed is uncertain.\n\nIn the absence of these concepts I apply common sense and logic. I like to keep an open mind about people and emerging technologies. I enjoy working in agile teams that can easily share knowledge and deliver results. I strongly believe collaboration is the key to success in life and with that in mind I'm an Open Source Software advocate.",
    "location": {
      "address": "5 Boston Mews",
      "postalCode": "NG51HL",
      "city": "Nottingham",
      "countryCode": "UK",
      "region": "Nottinghamshire"
    },
    "profiles": [
      {
        "network": "Github",
        "icon": "fa-github",
        "username": "vrtxf",
        "url": "https://github.com/vrtxf"
      },
      {
        "network": "Bitbucket",
        "icon": "fa-bitbucket",
        "username": "tedvortex",
        "url": "https://bitbucket.org/tedvortex"
      },
      {
        "network": "Stackoverflow",
        "icon": "fa-stack-overflow",
        "username": "vortex",
        "url": "http://stackoverflow.com/users/757375/vortex"
      },
      {
        "network": "Stackshare",
        "icon": "fa-stack-exchange",
        "username": "vrtxf",
        "url": "http://stackshare.io/vrtxf"
      },
      {
        "network": "Linkedin",
        "icon": "fa-linkedin",
        "username": "TED (Teodor Eugen Duțulescu) Vortex",
        "url": "https://uk.linkedin.com/in/tedvortex"
      },
      {
        "network": "AngeList",
        "icon": "fa-angellist",
        "username": "TED Vortex",
        "url": "https://angel.co/ted-vortex"
      },
      {
        "network": "Crunchbase",
        "icon": "fa-line-chart",
        "username": "TED Vortex",
        "url": "https://www.crunchbase.com/user/501304"
      },
      {
        "network": "Skype",
        "icon": "fa-skype",
        "username": "dutulescu.teodor",
        "url": "skype:dutulescu.teodor?call"
      },
      {
        "network": "Twitter",
        "icon": "fa-twitter",
        "username": "0_vortex",
        "url": "https://twitter.com/0_vortex"
      },
      {
        "network": "Soundcloud",
        "icon": "fa-soundcloud",
        "username": "VORT☰X",
        "url": "https://soundcloud.com/vorteks"
      },
      {
        "network": "Last.fm",
        "icon": "fa-lastfm",
        "username": "vrtxf",
        "url": "http://www.last.fm/user/vrtxf"
      }
    ],
    "email": "rodoeted@yahoo.com"
  },
  "work": [
    {
      "company": "Connected World Services (part of the Carphone Warehouse Group)",
      "position": "Software Developer",
      "website": "http://connectedworldservices.com",
      "startDate": "2014-12-01",
      "endDate": "2016-05-03",
      "summary": "My main attributions at CWS were:\n- Following full agile scrum methodologies and work flow via the complete Atlassian tool stack\n- Collecting requirements from line managers and internal stakeholders\n- Estimating and planning with project managers with a clear understanding of business goals\n- Creating and extending user interfaces to fit the requirements of stakeholders\n- Authoring software solution proposals following internal standards set by senior professionals\n- Coordinating with customers and application/product engineers to gain sign-off\n- Development of bespoke web applications, micro-services and APIs\n- Deployment of web applications to live servers\n- Implementing custom standardized backend logic for web applications\n- Understanding and following a hybrid TDD/BDD mindset\n\nAside of my normal tasks I was occasionally assigned to:\n- Integrate and push to distributed systems\n- Assess and integrate 3rd party APIs\n- Manage user access control for git repositories and do code reviews\n- Create web application build plans with functional testing",
      "highlights": [
        "Proposed gulp npm package, demonstrated it's usefulness in a live application and passed company standard review",
        "Authored a micro-service generator(prototype) based on existing technologies",
        "Lead late development of E2Save.com (2015), working together with senior developers, designers, product managers and business owners"
      ],
      "widget": [
        {
          "type": "stack",
          "title": "E2save stackshare",
          "description": "Collection of tools used for building http://e2save.com under CWS",
          "url": "http://stackshare.io/vrtxf/connected-world-services-2015"
        }
      ]
    },
    {
      "company": "Self-employed",
      "position": "Web Developer",
      "website": "",
      "startDate": "2013-10-01",
      "endDate": "2014-11-01",
      "summary": "With mobile devices rising above desktop usage I found myself unable to deliver native-like experiences with the synchronous technologies I was previously using.\nThis is the main reason I used most of my time consolidating my NodeJS skills and learning Puppet.\n\nWhy Puppet ?\nPuppet is built with a focus on client/server configuration within an infrastructure. However Puppet provides you with an extremely easy method for getting started and between Chef and an early version of Ansible I found Puppet to be the fastest way to power up my CentOS based vagrant environment into a secure production server.\n\nWhy NodeJS ?\n- Modularity: NodeJS provides a module-driven, highly scalable approach to application design, development and deployment that enables development teams to put the most desirable elements of agile methodology into practice.\n- JS backend: JavaScript on the server with Node further establishes it as the language of the web and its new uses on the server are helping to shape the future of the language itself.\n- Asynchronous Programming: JavaScript—and Node by extension—was designed for the web and the browser, where nothing is synchronous. Asynchronous JavaScript programs can perform many complex, parallel tasks in the browser. Node takes asynchronicity to the extreme on the server, making it the perfect choice for I/O-heavy and highly concurrent applications.\n- Module-driven Development: Node encourages developers to think in terms of creating small services that can be easily replaced or updated when necessary. By adopting a module-driven approach, Node developers can deconstruct the functionality of large monolithic applications and redesign them as a series of Node modules, bundled together to form a collection of services. This establishes an elegant simplicity in building scalable application functionality that improves both business and developer agility and leads to greater code-reuse.\n- Performance: Node represents an attractive compromise between performance concerns and platform approachability for developers. While there are other platforms able to match or exceed the performance of Node, none are as approachable for such a large portion of developers as Node via its reliance on JavaScript. Additionally, Node’s asynchronous programming model encourages performant development practices that are either difficult or risky in other languages and platforms.",
      "highlights": [
        "I started using CloudFlare because of easy DNS management, static resource optimisation (in conformance with page speed rules), DDoS protection and bandwidth usage. It's a highly customisable tool that I am still using to this date.",
        "I started using the EX and PX line of dedicated servers from https://www.hetzner.de which I am still using today. I managed multiple production nodes via Puppet in this period of time and Hetzner is my #1 recommendation."
      ],
      "widget": [
        {
          "type": "stack",
          "title": "Freelance 2014 StackShare",
          "description": "Most of the tools used while working freelance projects",
          "url": "http://stackshare.io/vrtxf/freelance-2014"
        }
      ]
    },
    {
      "company": "Computer Fun (expertvision.ro)",
      "position": "Lead Programmer",
      "website": "http://expertvision.ro",
      "startDate": "2009-06-01",
      "endDate": "2013-10-01",
      "summary": "My job as Lead Programmer included: \n- design and development of business critical web applications \n- management and development of a team of it professionals \n- project planning and estimates with business holders and customers\n- provisioning of support and solutions to team members in solving their work tasks\n- unit testing \n- performance and security auditing\n- collaboration with other departments and 3rd party service providers",
      "highlights": [
        "Created and maintained an in-house PHP content management framework built on top of Zend 2 and Symfony 2 components and following SEO best practices and performance optimisation",
        "The first commercial project I built and released on this framework was http://www.flax.ro - A versatile and secure LAMP framework that has proven its resilience over time and is still being used and maintained today by my former company",
        "Managed to watch over planning, development and release over 200 websites with the above mentioned framework; With most of these projects being executed in a team, I've switched roles many times, leveraging from building both the backend and the frontend towards coaching my team and improving the experience of undocumented users",
        "Created a complete Transbase to MySql database conversion of the TecDoc 2013 program"
      ],
      "widget": [
        {
          "type": "stack",
          "title": "ExpertVision StackShare",
          "description": "Most of the tools used while leading a small group of talented individuals",
          "url": "http://stackshare.io/vrtxf/expertvision-2013"
        }
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "Ioan Alexandru Brătescu-Voinești Grad school",
      "area": "Mathematics",
      "studyType": "Primary School",
      "startDate": "1996-01-01",
      "gpa": "",
      "courses": [],
      "endDate": "2004-01-01"
    },
    {
      "institution": "Ienăchiță Văcărescu National College",
      "area": "Mathematical Informatics",
      "studyType": "High School",
      "startDate": "2004-01-01",
      "gpa": "",
      "courses": [],
      "endDate": "2008-01-01"
    },
    {
      "institution": "Romanian - American University",
      "area": "Law",
      "studyType": "Bachelor",
      "startDate": "2008-01-01",
      "gpa": "-",
      "courses": [],
      "endDate": "2009-01-01"
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [
    {
      "name": "Web Application Development",
      "level": "Engineer",
      "keywords": [
        "HTML 5",
        "CSS 3",
        "Javascript",
        "Ecmascript 6",
        "jQuery",
        "D3",
        "React",
        "SASS",
        "LESS",
        "Gulp",
        "Grunt",
        "Babel",
        "Webpack",
        "Bootstrap",
        "Material UI",
        "Node",
        "Npm",
        "Eslint",
        "Yeoman",
        "Php",
        "Phalcon",
        "Composer",
        "MySQL",
        "MariaDb",
        "MongoDb",
        "Redis",
        "RabbitMQ",
        "Solr",
        "Microsoft SQL Server",
        "Git"
      ]
    },
    {
      "name": "Business Tools",
      "level": "Mid-Level",
      "keywords": [
        "Agile",
        "Scrum",
        "Asana",
        "Jira",
        "Confluence",
        "HipChat",
        "Skype",
        "Slack",
        "Google Apps"
      ]
    },
    {
      "name": "Mobile Development",
      "level": "First-Level",
      "keywords": [
        "Cordova",
        "Ionic",
        "Android SDK",
        "React Native",
        "NativeBase"
      ]
    },
    {
      "name": "DevOps",
      "level": "First-Level",
      "keywords": [
        "Puppet",
        "Ansible",
        "Vagrant",
        "Otto",
        "Parallels",
        "Virtualbox",
        "Packer",
        "Atlas",
        "Docker",
        "Shell Scripting",
        "CentOS",
        "Debian"
      ]
    }
  ],
  "languages": [
    {
      "language": "Romanian",
      "fluency": "Native or bilingual"
    },
    {
      "language": "English",
      "fluency": "Native or bilingual"
    },
    {
      "language": "French",
      "fluency": "Elementary"
    },
    {
      "language": "Italian",
      "fluency": "Elementary"
    },
    {
      "language": "German",
      "fluency": "Limited working"
    }
  ],
  "interests": [
    {
      "name": "React",
      "keywords": []
    },
    {
      "name": "Docker",
      "keywords": []
    },
    {
      "name": "Puppet",
      "keywords": []
    },
    {
      "name": "Node",
      "keywords": []
    }
  ],
  "references": []
}
